package NaNaSubway;

public class Sub_station { 
	
	//2호선
	public static String [] station2 = 
		{
				"신림", "봉천", "서울대입구", "낙성대", "사당", 
				"방배", "서초","교대", "강남", "역삼", 
				"선릉", "삼성", "종합운동장", "신천","잠실", 
				"잠실나루", "강변", "구의", "건대입구", "성수", 
				"뚝섬", "한양대", "왕십리", "상왕십리", "신당", 
				"동대문역사문화공원", "을지로4가", "을지로3가","을지로입구", "시청", 
				"충정로", "아현", "이대", "신촌", "홍대입구", 
				"합정", "당산", "영등포구청", "문래", "신도림", 
				"대림", "구로디지털단지", "신대방"
			
	};
	
	//3호선
	public static String [] station3 =
		{
			"대화", "주엽", "정발산", "마두", "백석", 
			"대곡", "화정", "원당","원흥", "삼송"
		     , "지축", "구파발", "연신내", "불광", "녹번", 
		     "홍제", "무악재", "독립문", "경복궁","안국"
		     , "종로3가", "을지로3가", "충무로" ,"동대입구", "약수", 
		     "금호" ,"옥수", "압구정" ,"신사", "잠원"
		     , "고속터미널", "교대", "남부터미널", "양재", "매봉" ,
		     "도곡" , "대치", "학여울", "대청", "일원"
		     , "수서", "가락시장", "경찰병원", "오금"
		
		};
	
	//4호선
	public static String [] station4 = 
		{
			"당고개", "상계","노원", "창동", "쌍문" 
			,"수유", "미아", "미아사거리", "길음", "성신여대입구"
			, "한성대입구", "혜화", "동대문", "동대문역사문화공원", "충무로"
			, "명동", "회현", "서울", "숙대입구", "삼각지"
			, "신용산", "이촌", "동작", "이수", "사당"
			, "남태령", "선바위", "경마공원", "대공원", "과천"
			, "정부과천청사", "인덕원", "평촌", "범계", "금정"
			, "산본", "수리산", "대야미", "반월", "상록수"
			, "한대앞", "중앙", "고잔", "초지", "안산"
			, "신길온천", "정왕","오이도"

		};
	
	//열차 상태를 랜덤으로 뽑아주는 메서드
	public static String getsub_Condition() {
		
		String [] subwayCondition = {"(원활)", "(혼잡)", "(보통)"};

		int index = (int) (Math.random() * subwayCondition.length);

		return subwayCondition[index];
	}

	//역 사이의 거리는 최소 1에서 최대 4로 설정한다.
	public static int [] howfar_station = {1,2,3,4};

}

